In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

C:\Users\ajitp\Anaconda3\lib\site-packages\statsmodels\tools\_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
# Typical types of data

# Structured
#         -- A well structured or structured data is available in the form of clean tabules.
#         -- Excel, CSV, SQL, etc.
# Unstructured
#         -- Images, Videos, Audio, Text Documents, etc.
# Semi structured
#         -- Mixed data

# Table

# Index   |     Name     |     Length    |    IMDB Review    |    Link_to_File
# 1       |    Titanic   |     160 min   |    8.0            |    ./movies/mov_001.mov
# 2       |    Avengers  |     140 min   |    7.5            |    ./movies/mov_002.mp4
# 3       |    Matrix    |     130 min   |    7.0            |    ./movies/mov_003.wmv

In [3]:
# DataFrame vs Series

In [10]:
df = pd.read_csv('OfficeSupplies.csv')

In [7]:
#df1 = pd.read_csv('officesupplies.csv')

In [11]:
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99
1  12-Jul-2014     East     Nick   Binder     29        1.99
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49
3  29-Jul-2014     East    Susan   Binder     81       19.99
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95

In [12]:
type(df)

pandas.core.frame.DataFrame

In [14]:
type(df['Units'])

pandas.core.series.Series

In [15]:
type(df.iloc[0])

pandas.core.series.Series

In [21]:
df.iloc[0]

OrderDate     4-Jul-2014
Region              East
Rep              Richard
Item             Pen Set
Units                 62
Unit Price          4.99
Name: 0, dtype: object

In [23]:
df.iloc[0]["Units"]

62

In [24]:
names = pd.Series(['John','Jake','Marie'])

In [25]:
names

0     John
1     Jake
2    Marie
dtype: object

In [26]:
ages = pd.Series([23, 25, 25])

In [27]:
ages

0    23
1    25
2    25
dtype: int64

In [28]:
persons = pd.DataFrame(names, ages)

In [29]:
persons

      0
23  NaN
25  NaN
25  NaN

In [30]:
persons = pd.DataFrame([names, ages])

In [31]:
persons

      0     1      2
0  John  Jake  Marie
1    23    25     25

In [33]:
persons.transpose()

       0   1
0   John  23
1   Jake  25
2  Marie  25

In [35]:
persons = pd.DataFrame({'name': names, 'age': ages})

In [36]:
persons

    name  age
0   John   23
1   Jake   25
2  Marie   25

In [45]:
persons1 = pd.DataFrame({'NameOfPerson': names, 'AgeOfPerson': ages})

In [46]:
persons1

  NameOfPerson  AgeOfPerson
0         John           23
1         Jake           25
2        Marie           25

In [47]:
pd.DataFrame(zip(names,ages), columns=['name','age'])

    name  age
0   John   23
1   Jake   25
2  Marie   25

In [48]:
persons = pd.DataFrame({'name': names, 'age': ages, 'person name': names, 'person age': ages})

In [49]:
persons

    name  age person name  person age
0   John   23        John          23
1   Jake   25        Jake          25
2  Marie   25       Marie          25

In [53]:
persons['name']

0     John
1     Jake
2    Marie
Name: name, dtype: object

In [54]:
persons.name

0     John
1     Jake
2    Marie
Name: name, dtype: object

In [55]:
persons.age

0    23
1    25
2    25
Name: age, dtype: int64

In [56]:
persons['person name']

0     John
1     Jake
2    Marie
Name: person name, dtype: object

In [52]:
persons.person name

SyntaxError: invalid syntax (<ipython-input-52-1bbcf874ed20>, line 1)

In [57]:
# TO change column names in Pandas DataFrame

In [58]:
persons.columns

Index(['name', 'age', 'person name', 'person age'], dtype='object')

In [65]:
index_list = persons.index
index_list

RangeIndex(start=0, stop=3, step=1)

In [66]:
index_list.values

array([0, 1, 2], dtype=int64)

In [67]:
persons.index.values

array([0, 1, 2], dtype=int64)

In [61]:
persons

    name  age person name  person age
0   John   23        John          23
1   Jake   25        Jake          25
2  Marie   25       Marie          25

In [68]:
persons.columns = ['name','age','person_name','person_age']

In [69]:
persons

    name  age person_name  person_age
0   John   23        John          23
1   Jake   25        Jake          25
2  Marie   25       Marie          25

In [70]:
p2 = pd.DataFrame({'name': names, 'age': ages, 'person name': names, 'person age': ages})

In [74]:
p2.columns

Index(['name', 'person_name', 'age', 'person_age'], dtype='object')

In [75]:
p2.columns = ['name', 'age', 'person_name', 'person_age']

In [76]:
p2

    name  age person_name  person_age
0   John   23        John          23
1   Jake   25        Jake          25
2  Marie   25       Marie          25

In [82]:
?p2.rename

In [80]:
p2 = p2.rename(columns={'person_name': 'NameOfPerson'})

In [81]:
p2

    name  age NameOfPerson  person_age
0   John   23         John          23
1   Jake   25         Jake          25
2  Marie   25        Marie          25

In [83]:
p3 = p2.rename(columns={'NameOfPerson': 'name_of_person'})

In [84]:
p3

    name  age name_of_person  person_age
0   John   23           John          23
1   Jake   25           Jake          25
2  Marie   25          Marie          25

In [85]:
p2

    name  age NameOfPerson  person_age
0   John   23         John          23
1   Jake   25         Jake          25
2  Marie   25        Marie          25